import pyaudio

# 音频参数
AUDIO_CONFIG = {
    'FORMAT': pyaudio.paInt16,
    'CHANNELS': 1,
    'RATE': 16000,  # 16kHz对于语音识别足够
    'CHUNK': int(16000 * 0.01),  # 小块数据降低延迟
    'VAD_AGGRESSIVENESS': 3,  # VAD激进程度 (0-3)
    'INPUT_DEVICE_INDEX': None,  # 设为None自动选择，或指定具体索引
}

# 人物位置配置
PLAYER_CONFIG = {
    'LOCATION': 'left',  # 枚举：left right 默认人物在左边
}

# 语音指令映射
COMMAND_MAPPING = {
    "转向": ["@"],
    "发波": ["s", ("s", "d"), "d", "o"],
    "升龙": ["d", ("s", "d"), "s", ("s", "d"), "d", "i"],
    "迸发": ["y"],
    "下中脚": [("s", "k")],
    "下中脚取消": [("s", "k"), "", "", "h"],
    "下中拳": [("s", "i")],
    "取消": ["h"],
    "重拳": ["o"],
    "中拳": ["i"],
    "中拳重拳": ["i", "", "", "", "", "o"],
    "tc": ["i", "#4", "o"],
    "跑旋风腿": [("j", "k"), "#6", 's', ("s", "a"), ('a', 'j'), 'j'],
    "TC跑旋风腿": ["$tc", "#34","$跑旋风腿"],
    "跳重脚": ['w', "#29", 'l'],
    "绿冲": ['h', ("h", "d"), "h", ("h", "d")],
    "跑升龙": [("j", "k"), 'd', ("d", "s"), ('d', 'i'), 'i'],
    "一个z": ['s', ("s", "d"), 'd', 's', ("s", "d"), 'd', 'i'],
    "机库金莱": ['s', ("s", "d"), 'd', 's', ("s", "d"), 'd', 'k'],
    "SAE": ['s', ("s", "a"), 'a', 's', ("s", "a"), 'a', 'k'],
    "多达": ['d', ("d", "s"), 's', ("s", "d"), 'd', 'l'],
    "投他": [("j", "u")],
    "咿呀": ['s', ("s", "d"), 'd', 'k', '#5', 'j'],
    "下中脚复合": ['$下中脚取消', "#17", '$下中拳', "#47", "$TC跑旋风腿"],
}